tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "omrikiei/ktunnel"
tap "pls-rs/pls"
brew "xz"
brew "bash"
brew "openssl@3"
brew "bat"
brew "bc"
brew "btop"
brew "clipboard"
brew "coreutils"
brew "curl"
brew "curlie"
brew "deno"
brew "direnv"
brew "fd"
brew "gnutls"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "glab"
brew "glow"
brew "gnu-sed"
brew "hurl"
brew "imagemagick"
brew "jq"
brew "node"
brew "jupyterlab"
brew "kubernetes-cli"
brew "markdownlint-cli"
brew "maven"
brew "navi"
brew "neovim"
brew "nowplaying-cli"
brew "nushell"
brew "nvm"
brew "pipx"
brew "podman"
brew "podman-compose"
brew "poppler"
brew "pyenv"
brew "python@3.12"
brew "qemu"
brew "ripgrep"
brew "sesh"
brew "sevenzip"
brew "starship"
brew "stow"
brew "tcl-tk"
brew "tealdeer"
brew "tmux"
brew "unixodbc"
brew "uv"
brew "wget"
brew "xmlstarlet"
brew "yarn"
brew "yazi"
brew "yq"
brew "zlib"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "databricks/tap/databricks"
brew "felixkratz/formulae/borders"
brew "hashicorp/tap/terraform"
brew "intuit/eiamcli/eiamcli"
brew "intuit/idps/stash"
brew "omrikiei/ktunnel/ktunnel"
brew "pls-rs/pls/pls"
cask "claude-code"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-noto-sans-symbols-2"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "ngrok"
cask "postman"
cask "raycast"
